In [2]:
import pandas as pd 

df = pd.read_csv("random_people.csv")

In [3]:
#start getting a feel of the data
df.head(10)

   Unnamed: 0     name  surname  salary
0           0    Henry  Joneson    5000
1           1   Albert  Goodman   10000
2           2  William  Goodman   10000
3           3     John  Joneson   10000
4           4   Albert    Black   10000
5           5    Henry  Joneson   12000
6           6  Richard    Green    5500
7           7    Henry  Joneson   11000
8           8    Henry  Goodman   12000
9           9   Albert  Joneson   11000

In [6]:
df['salary'].value_counts()

10000    16
12000     8
11000     7
9500      6
5500      5
13500     5
5000      3
Name: salary, dtype: int64

In [12]:
df['salary'].median()

10000.0

In [13]:
df["salary_after_tax"] = df["salary"]*.8

In [15]:
def tax(s):
    if s>=6000:
        return s*.7
    else:
        return s*.85

In [16]:
df["salary_after_tax"] = df["salary"].apply(tax)

   Unnamed: 0     name  surname  salary  salary_after_tax
0           0    Henry  Joneson    5000            4250.0
1           1   Albert  Goodman   10000            7000.0
2           2  William  Goodman   10000            7000.0
3           3     John  Joneson   10000            7000.0
4           4   Albert    Black   10000            7000.0

In [18]:
df_low = df[df["salary"]<6000]
df_high = df[df["salary"]>=6000]

In [20]:
df_high["salary"].mean()

10892.857142857143

In [47]:
df_low= df.loc[df["salary"]<6000,"salary"]
df.loc[df["salary"]<6000,"salary_after_tax"] = df_low*.85

In [41]:
df_low.columns[1]="salary_after_tax"
df[df["salary"]<6000]["salary_after_tax"] = df_low['salary_after_tax']

AttributeError: 'Series' object has no attribute 'columns'

In [38]:
df_low

0     4250.0
6     4675.0
14    4675.0
17    4675.0
21    4250.0
32    4675.0
33    4250.0
37    4675.0
Name: salary, dtype: float64